app/controllers/users_controller.rb

  def create
    @user = User.create(name: params[:user][:name], mail: params[:user][:mail])
---
INSERT INTO "users" ("name", "mail", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sdsfad"], ["mail", "sdfsd"], ["created_at", "2017-10-14 01:09:57.578628"], ["updated_at", "2017-10-14 01:09:57.578628"]]

  def show
    @users = User.where(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]

  def destroy
    User.where(id: params[:id]).delete_all
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 120]]